uhnp/src/DataProcessors/ВыборСпособовПокрытияПотребностиВФинансировании/ВыборСпособовПокрытияПотребностиВФинансировании.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВыборСпособовПокрытияПотребностиВФинансировании</name>
</mdclass:DataProcessor>

uhnp/src/Enums/Периодичность/Периодичность.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Периодичность</name>
  <comment>(Упр)(-УХМодульМенеджера)</comment>
  <enumValues>
    <name>День</name>
  </enumValues>
  <enumValues>
    <name>Неделя</name>
  </enumValues>
  <enumValues>
    <name>Декада</name>
  </enumValues>
  <enumValues>
    <name>Месяц</name>
  </enumValues>
  <enumValues>
    <name>Квартал</name>
  </enumValues>
  <enumValues>
    <name>Полугодие</name>
  </enumValues>
  <enumValues>
    <name>Год</name>
  </enumValues>
  <enumValues>
    <name>ДевятьМесяцев</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Catalogs/Периоды/Периоды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Периоды</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>Произвольный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНаименование1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНаименование2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

uhnp/src/DataProcessors/ВыборСпособовПокрытияПотребностиВФинансировании/Forms/ФормаПараметровЗакупок/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПериодЗакупок 		= ПериодТекущийГод(); 
	ОрганизацияЗаказчик	= Параметры.Организация;

КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Применить(Команда) 
	
	Если Не ЗначениеЗаполнено(ПериодЗакупок) Тогда
		ТекстСообщения = НСтр("ru = 'Перед созданием необходимо выбрать период'");
        ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,"ПериодЗакупок");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ОрганизацияЗаказчик) Тогда
		ТекстСообщения = НСтр("ru = 'Перед созданием необходимо выбрать организацию-заказчика'");
        ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,"ОрганизацияЗаказчик");
		Возврат;
	КонецЕсли;    

	Если Не ЗначениеЗаполнено(СпособВыбораПоставщика) Тогда
		ТекстСообщения = НСтр("ru = 'Перед созданием необходимо выбрать способ закупки'");
        ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,"СпособВыбораПоставщика");
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ДатаОфициальногоОбъявленияЗакупки) Тогда
		ТекстСообщения = НСтр("ru = 'Перед созданием необходимо выбрать дату официального объявления закупки'");
        ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,"ДатаОфициальногоОбъявленияЗакупки");
		Возврат;
	КонецЕсли;
	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("ПериодЗакупок",			ПериодЗакупок);
	СтруктураОтвета.Вставить("ОрганизацияЗаказчик",		ОрганизацияЗаказчик);  
	СтруктураОтвета.Вставить("СпособВыбораПоставщика",	СпособВыбораПоставщика); 
	СтруктураОтвета.Вставить("ДатаОфициальногоОбъявленияЗакупки",	ДатаОфициальногоОбъявленияЗакупки); 
	Закрыть(СтруктураОтвета);  
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПериодТекущийГод()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Периоды.Периодичность КАК Периодичность,
		|	Периоды.Ссылка КАК Ссылка,
		|	Периоды.ДатаНачала КАК ДатаНачала
		|ИЗ
		|	Справочник.Периоды КАК Периоды
		|ГДЕ
		|	Периоды.Периодичность = &Периодичность
		|	И Периоды.ДатаНачала = &ДатаНачала";
	
	Запрос.УстановитьПараметр("ДатаНачала", 		НачалоГода(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("Периодичность", 		Перечисления.Периодичность.Год);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка; 			
	Иначе
		Возврат Неопределено;	
	КонецЕсли;

КонецФункции // ()


#КонецОбласти
